app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT "pages".* FROM "pages"

  def show
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("avgduration", "created_at", "site_id", "totalvisits", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)