app/controllers/sites_controller.rb

SELECT "sites".* FROM "sites"
---
  def index
    @sites = Site.all

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", "120"]]
---
  def show
    @site = Site.find(params[:id])

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @site = Site.find(params[:id])

INSERT INTO "sites" ("avgduration", "created_at", "id", "name", "totalvisits", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["avgduration", nil], ["created_at", Sun, 24 Feb 2013 23:37:49 UTC +00:00], ["id", 120], ["name", "my second site"], ["totalvisits", nil], ["updated_at", Sun, 24 Feb 2013 23:37:49 UTC +00:00]]
---
  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save

SELECT "sites".* FROM "sites" WHERE "sites"."id" = 5 LIMIT 1
SELECT "pages".* FROM "pages" WHERE "pages"."url" = 'index.html' AND "pages"."site_id" = 5 LIMIT 1
INSERT INTO "pages" ("avgduration", "created_at", "site_id", "totalvisits", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "pages" SET "avgduration" = 1.117, "totalvisits" = 2, "updated_at" = '2013-02-25 16:36:51.964782' WHERE "pages"."id" = 10
---
  def visits
    set_cors_headers
    logger.info "in sites#visits method"
    if request.xhr?
      logger.info "Request is xhr"
      @site = Site.find_by_id(params[:id])

      # Create a new page if the visited URL is not yet in our list of tracked pages
      unless @site.nil?
        logger.info "existing site found!"
        @page = Page.find_by_url_and_site_id(params[:pageUrl], params[:id])
        logger.info "Looking for page... is it nil? #{@page.nil?}"

        if @page.nil?
          @page = Page.new
          @page.url = params[:pageUrl]
          @page.site_id = params[:id]
          logger.info "New page created? #{@page.valid?}"
        end

        seconds = params[:duration] * 0.001
        # Calculate new average duration
        @page.register_visit(seconds)
        @page.save