app/controllers/sites_controller.rb

  def visits
    set_cors_headers
    if request.xhr?
      @site = Site.find_by_id(params[:id])

      #if the site doesn't exist, create a new site instance with 0 visits
      if @site.nil?
        @site = Site.new
        @site.id = (params[:id])
        @site.name = 'unnamed site'
      end

      #convert duration from milliseconds to seconds
      seconds = params[:duration] * 0.001


      #if the page doesn't exist on our analytics tracking site, create a new page instance with 0 visits
      @page = Page.find(params[:pageUrl])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "asdf.html"]]