app/views/sites/index.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."site_id" = 1
---
    <tr>
      <td rowspan="<%= site.pages.count+1 %>"><%= site.id %></td>